ClarkeNeedles/freertos-can-telematics/stm32/Drivers/NEO6M/neo6m.h
/**
  ******************************************************************************
  * @file           : neo6m.h
  * @brief          : Header file for NEO-6M sensor driver
  * @author         : Clarke Needles
  ******************************************************************************
  */

#ifndef NEO6M_H
#define NEO6M_H

#include "stm32f4xx_hal.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <usart.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 * ============================================================================
 *                     	##### NEO6M DEFINITIONS #####
 * ============================================================================
 */

#define GPSBUFSIZE  128   // GPS buffer size

/*
 * ============================================================================
 *                     	  ##### TYPE DEFINITIONS #####
 * ============================================================================
 */

typedef struct{
    // Calculated values
    float dec_longitude;
    float dec_latitude;
    float altitude_ft;

    // GGA - Global Positioning System Fixed Data
    float nmea_longitude;
    float nmea_latitude;
    float utc_time;
    char ns, ew;
    int lock;
    int satelites;
    float hdop;
    float msl_altitude;
    char msl_units;

    // RMC - Recommended Minimmum Specific GNS Data
    char rmc_status;
    float speed_k;
    float course_d;
    int date;

    // GLL
    char gll_status;

    // VTG - Course over ground, ground speed
    float course_t; // ground speed true
    char course_t_unit;
    float course_m; // magnetic
    char course_m_unit;
    char speed_k_unit;
    float speed_km; // speek km/hr
    char speed_km_unit;
} NEO6M_Data_t;

typedef struct
{
	UART_HandleTypeDef *huart;

	// Receive buffer
	uint8_t rx_data = 0;
	uint8_t rx_buffer[GPSBUFSIZE];
	uint8_t rx_index = 0;

  NEO6M_Data_t gps_data;
} NEO6M_Handle_t;

/*
 * ============================================================================
 *                     	   ##### PUBLIC API #####
 * ============================================================================
 */

/**
 * @brief Initializes the NEO-6M GPS receiver driver structure.
 *
 * This function prepares the driver handle context and arms the low-level STM32
 * UART peripheral hardware to listen for incoming characters. It triggers the
 * first asynchronous background byte capture sequence using non-blocking interrupts.
 *
 * @param[in,out] dev Pointer to the master NEO6M handle structure to initialize.
 *
 * @retval HAL_OK    The background interrupt listener armed successfully.
 * @retval HAL_ERROR The underlying HAL UART interrupt register subsystem failed to arm.
 */
HAL_StatusTypeDef NEO6M_Init(NEO6M_Handle_t *dev);


HAL_StatusTypeDef NEO6M_UART_CallBack(NEO6M_Handle_t *dev);

#ifdef __cplusplus
}
#endif

#endif /* NEO6M_H */
